---
kind: method
id: M:Autodesk.Revit.DB.ChangeType.Dispose
source: html/871e7a34-2198-8d59-61c0-b4511ea7b544.htm
---
# Autodesk.Revit.DB.ChangeType.Dispose Method

Releases all resources used by the ChangeType

## Syntax (C#)
```csharp
public void Dispose()
```